trade_exp/src/InformationRegisters/ИзучениеАссортимента/ИзучениеАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b317592f-8123-46ff-bba3-43fde545752f">
  <name>ИзучениеАссортимента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
</mdclass:InformationRegister>

trade_exp/src/Documents/ИзучениеАссортимента/ИзучениеАссортимента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e3966a33-4e26-4291-8885-291481276d8a">
  <name>ИзучениеАссортимента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="faae7a24-5d27-40be-a7b6-1e05f58e63fa">
    <name>ТочкаПересчетаОбучение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="035828aa-7633-4717-b475-b1b0ec830fcf">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="96cc621f-b44f-4924-8c9f-5377f80fc628">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ab2c60eb-13c2-4bfc-af5c-dc6dde24f839">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ef1aadab-b747-444b-bb54-218663ee9a3c">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="10d9aa4c-055c-4234-839d-84735907ce3d">
    <name>ПоследняяОткрытаяСтрока</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3b90ff3f-1959-4a33-8f18-be5e98056bbd">
    <name>ВремяВСекундах</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="c56ed891-7433-499a-91b0-1fc6e34d488a">
    <name>Ассортимент</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="25a5259f-a415-48b7-a747-57e549e4ca1e">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1e118687-55e4-4900-abc6-ec4188238f3f">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="56befc85-bfa6-47b0-8b4d-221f84b59c34">
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e83b1228-7d2d-41ff-9a3a-e84cba1ed1bd">
      <name>Проверено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d3a639c1-2b27-41d6-9e27-94d99668f40f">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ИзучениеАссортимента/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&НаСервере
Процедура ОбновитьЗаписьВРегистре(Ссылка) Экспорт 
	УстановитьПривилегированныйРежим(Истина); 	
	Запрос = Новый Запрос;
 	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИзучениеАссортимента.Ссылка КАК Ссылка,
	|	ИзучениеАссортимента.Дата КАК Период,
	|	ИзучениеАссортимента.Склад КАК Склад,
	|	ИзучениеАссортимента.Секция КАК Секция,
	|	ИзучениеАссортимента.ТочкаПересчетаОбучение КАК ТочкаПересчетаОбучение,
	|	ИзучениеАссортимента.Сотрудник КАК Сотрудник,
	|	ИзучениеАссортимента.Статус КАК Статус,
	|	ИзучениеАссортимента.ПоследняяОткрытаяСтрока КАК ПоследняяОткрытаяСтрока,
	|	ИзучениеАссортимента.ВремяВСекундах КАК ВремяВСекундах,
	|	СУММА(ВЫБОР
	|			КОГДА ИзучениеАссортиментаАссортимент.Проверено
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПроверено,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ИзучениеАссортиментаАссортимент.Проверено
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоОшибок
	|ИЗ
	|	Документ.ИзучениеАссортимента КАК ИзучениеАссортимента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзучениеАссортимента.Ассортимент КАК ИзучениеАссортиментаАссортимент
	|		ПО (ИзучениеАссортимента.Ссылка = ИзучениеАссортиментаАссортимент.Ссылка)
	|ГДЕ
	|	ИзучениеАссортимента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзучениеАссортимента.Ссылка,
	|	ИзучениеАссортимента.Дата,
	|	ИзучениеАссортимента.Склад,
	|	ИзучениеАссортимента.Секция,
	|	ИзучениеАссортимента.ТочкаПересчетаОбучение,
	|	ИзучениеАссортимента.Сотрудник,
	|	ИзучениеАссортимента.Статус,
	|	ИзучениеАссортимента.ВремяВСекундах,
	|	ИзучениеАссортимента.ПоследняяОткрытаяСтрока";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить(); 
	
	Выборка = Результат.Выбрать(); 
	
	Если Выборка.Следующий() Тогда  
		
		НаборЗапись = РегистрыСведений.ИзучениеАссортимента.СоздатьНаборЗаписей();
		НаборЗапись.Отбор.Регистратор.Установить(Ссылка);
		НаборЗапись.Прочитать();
			Если НаборЗапись.Количество() = 0 Тогда
			    ЗаписьВРегистр = НаборЗапись.Добавить();
			Иначе
				ЗаписьВРегистр = НаборЗапись[0];
			КонецЕсли;
		ЗаписьВРегистр.Период = Выборка.Период;	
		ЗаписьВРегистр.Регистратор = Выборка.Ссылка;	
		ЗаписьВРегистр.Склад = Выборка.Склад;
		ЗаписьВРегистр.Секция = Выборка.Секция;
		ЗаписьВРегистр.ТочкаПересчетаОбучение = Выборка.ТочкаПересчетаОбучение; 
		ЗаписьВРегистр.Сотрудник = Выборка.Сотрудник;
		ЗаписьВРегистр.Статус = Выборка.Статус;
		ЗаписьВРегистр.ПоследняяОткрытаяСтрока = Выборка.ПоследняяОткрытаяСтрока;	
		ЗаписьВРегистр.ВремяВСекундах = Выборка.ВремяВСекундах;
		ЗаписьВРегистр.КоличествоПроверено = Выборка.КоличествоПроверено;
		ЗаписьВРегистр.КоличествоОшибок = Выборка.КоличествоОшибок;
		НаборЗапись.Записать(Истина);        
				
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь); 


КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьВРегистре(Ссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина); 
	
	НаборЗапись = РегистрыСведений.ИзучениеАссортимента.СоздатьНаборЗаписей();
	НаборЗапись.Отбор.Регистратор.Установить(Ссылка);
	НаборЗапись.Записать();
   
	УстановитьПривилегированныйРежим(Ложь);  
КонецПроцедуры

#КонецЕсли
